app/controllers/application_controller.rb

SELECT `coaches`.* FROM `coaches` WHERE `coaches`.`id` = 6 LIMIT 1
---
    def current_coach

        return nil if !session[:auth] || !session[:auth]['id']

        return @_coach if @c_oach

        @_coach = Coach.find_by_id(session[:auth]['id'])