app/controllers/sessions_controller.rb

  def create

    coach_params = params.require(:coach)

    @coach = Coach.where('confirmed = true AND (username = :username OR email = :username)', username: coach_params[:username]).first
---
SELECT `coaches`.* FROM `coaches` WHERE (`coaches`.`username` = 'jean465.jean@icloud.com' OR `coaches`.`email` = 'jean465.jean@icloud.com') ORDER BY `coaches`.`id` ASC LIMIT 1